<title>Документация по Native Land</title>
<link rel='stylesheet' type='text/css' href='docstyle.css'/>
<body background="images/back.jpe">
<center><h2><font color=blue>Документация по Native Land</font></h2></center>
<A NAME="BEGIN"></A>
<h3><font color=yellow>Содержание</font></h3>
<dd><h4><font color=white>Вводная часть</font></h4>
<dd><dd><a href="#intro">Введение</a><br>
<dd><dd><a href="#history">Предыстория</a><br>
<dd><dd><a href="#enter">Авторизация и выход</a><br>
<dd><dd><a href="#rules">Правила общения</a><br>
<dd><h4><font color=white>Элементы РПГ. Ваш персонаж</font></h4>
<dd><dd><a href="#create">Создание персонажа</a><br>
<dd><dd><a href="#main">Основные характеристики</a><br>
<dd><dd><a href="#add">Дополнительные характеристики</a><br>
<dd><dd><a href="#expa">Опыт героя и уровни</a><br>
<dd><dd><a href="#inv">Инвентарь</a><br>
<dd><dd><a href="#weapons">Оружие и артефакты</a><br>
<dd><dd><a href="#battles">Битвы с монстрами</a><br>
<dd><dd><a href="#vspeople">Битвы с людьми</a><br>
<dd><dd><a href="#respawn">Лечение и восстановление</a><br>
<dd><dd><a href="#magic">Магия</a><br>
<dd><h4><font color=white>Элементы стратегии. Ваше королевство</font></h4>
<dd><dd><a href="#resources">Ресурсы</a><br>
<dd><dd><a href="#money">Деньги и их курс. Основной ресурс.</a><br>
<dd><dd><a href="#bank">Банк</a><br>
<dd><dd><a href="#trade">Торговля</a><br>
<dd><dd><a href="#build">Строительство</a><br>
<dd><dd><a href="#army">Армия и её применение</a><br>
<dd><dd><a href="#unions">Военные союзы</a><br>
<dd><dd><a href="#clans">Кланы</a><br>
<dd><dd><a href="#spy">Разведка и шпионаж</a><br>
<dd><h4><font color=white>Завершающая часть</font></h4>
<dd><dd><a href="#mustdo">Законы и правила игры</a><br>
<dd><dd><a href="#faq">Часто задаваемые вопросы и ответы</a><br>
<dd><dd><a href="#outro">Заключение</a><br>

<br><br>
<A NAME="INTRO"><b><font color=blue>Введение</font></b></A><br>
<dd>Эта игра была задумана после долгих странствий по интернету и поиска чего-либо подобного. После утомительных поисков, мы всё же отчаялись и решили создать свою игру - стратегию с элементами РПГ. Стратегия и РПГ сочетаются здесь примерно 40% / 60%. Возможно, кто-нибудь и скажет, что мы плохо искали, но всё же, результат перед Вами. Оценивайте, критикуйте и наслаждайтесь. Очень надеемся, что эта игра Вам понравится. Любые Ваши предложения мы с радостью примем по <a href="mailto:dima_eliseev@users.mns.ru"><font color=white>этому</font></a> адресу. Далее Вы ознакомитесь с правилами игры и рекомендациями. Настоятельно рекомендуем Вам их прочитать.<br><dd><dd><dd><dd><dd><dd><dd><dd><dd><dd><dd><dd>Дмитрий и Олег<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>


<br><br>
<A NAME="HISTORY"><b><font color=blue>Предыстория</font></b></A><br>
<dd>Давным-давно когда земля пережила первую битву за скипетр всевластия. Было создано "Братство жизни". Братство состояло из 13 воинов (бессмертных воинов получивших право на свою жизнь у великих богов). Шесть воинов света, шесть воинов тьмы и тринадцатым воином был воин забвения не относящийся не к добру не к злу.
<br>
<dd><dd><b>Воины света</b>
<dd>Тарон - рыцарь, бывший хранитель доспехов веры перешедший на сторону света по личным причинам, не известным никому. Молчаливый не любит просто так трепать языком, но в тоже время добрый и внимательный обладал способностью танец мечей (во время битвы мечи начинают вращаться вокруг него как щит).
<dd>Миролт - маг Бывший хранитель храма судьбы. Верит в добро, не любит войну, но при необходимости использует все свои знания для защиты, владеет в совершенстве магией природы и души (рассеивала все заклинания наложенные на всех союзных воинов)
<dd>Миррала - стрелок бывшая охотница в совершенстве владеющая луком. Если армия противника находится в лесу не один человек не выйдет из леса живым. Секретный суперудар - ураган стрел. Характер буйный, не любит сидеть на одном месте долго. В армии Лизарда находится во главе группы разведчиков.
<dd>Ролон - варвар, изгнанный из своего племени за доброту и желание помогать всем. Характер мягкий, не пьет. Владеет страшной магией берсеркт. Говорят, что там, где прошли берсеркты, не остается ничего живого. Входит в транс и под какими-то чарами, не изученными никем, начинает сражаться без чувств. Исчезает и появляется только одна цель уничтожить.
<dd>Сирита - волшебница, вызывающая животных, с самого начала была с Лизардом. Была его правой рукой. Владеет способностью вызывать Роголона. Это древний дракон, спящий в пещере сна. Характер веселый игривый. Любит цветы и музыку.
<dd>Вария - целительница обладает магией исцеления. Источник молодости, дающий воинам силу и здоровье. Не известно когда он появился, кто он и откуда он. Особая характеристика: ни разу не проронил, ни слова.
<br>
<dd><dd><b>Войны тьмы</b>
<dd>Фарот и Факот - два брата Фарот - рыцарь. Характер очень скверный много пьет, любит запах крови, не терпит запах цветов, владеет ударом смерти (все, до кого Фарот касается своим мечом, умирают, так как раны не могут залечить обычные лекарства)
<dd>Факот - это одни словом маньяк. Любит убивать. С его жестокостью может, сравнится только сатана, но даже он не убивал без причин. Владеет ударом "разрыв небес". С неба начинают бить молнии и лить кислотный дождь.
<dd>Ритира - волшебница, которая поднимает мертвых очень скверный характер делает все только для личной выгоды, никогда не останавливалась не перед чем и ни перед кем в достижении цели ее супер оружием было призвание сил ада (сам цербер сражался на ее стороне).
<dd>Соборг - маг. Информации о нем нет, кроме того, что он, правая рука Мохолда и владеет магией проклятия!
<dd>Темный эльф - нет ни имени, ни чего, но о ней известно, что лес ее дом и в нем даже блоха не пройдет так, чтобы она не узнала. Ее старый противник это Миррала. О силе черного эльфа неизвестно почти нечего, кроме того, что они могут перемещаться по воздуху.
<dd>Долоритонт - черный целитель, владеющий магией вампиризма и заклинанием "когти смерти". Никто ни видел его лица, так как он был в тени или наверно лучше сказать, что тень была вечно на его лице.
<br>
<dd>В тайне от своих повелителей они заключили договор о том, что любыми силами прекратят эту войну и после ее прекращения они должны тоже исчезнуть. Причиной их объединения стало то, что их великие повители забыли о первопричинах этой войны. Причина для света было то, что тьма пытается установить порядок там, где сила решает все, а со стороны света знание должно быть важнее. Но повелители забыли об этом, и их целью стало уничтожение друг друга любой ценой. Повелителем света был Лизард из древнего рода Картареанцев. Лизард - великий воин, не знавший поражения среди своих, знавший все секреты магов, и обладавший силой титанов. Повелителем тьмы был Мохолд из древнего рода трианцев. Великий воин не знавший поражения среди своих, великолепно владеющий мечом имевший силу дракона и не имевший страха не перед людьми не перед чудовищами.
<dd>Итогом этой войны могло быть уничтожения мира. Но войны заключившие союз решили противостоять этому и в тот момент, когда была последняя из битв между Лизардом и Мохолдом, тринадцать воинов обрушили свою силу и силу скипетра на них и два повелителя, света и тьмы были уничтожены.
<dd>После смерти повелителей была написана эта книга, книга "Времён" недоступная для живых и мертвых. Та, которая хранит тайны прошлого и знание будущего и настоящего. Эту книгу создали те тринадцать воинов, которые остались после битвы. Но чтобы создать такой мощный артефакт им потребовалось отдать свои души. Душа тринадцатого война запечатала книгу и люди, служившие им, похоронили ее. Песок времени стер из памяти все, что было связано с книгой, и о ней забыли, но то, что в мире есть великое зло, помнили все. Прошло много лет с тех пор, но однажды один из детей, игравших в лесу, нашел свиток, гласивший о том, что-то, что находится в тени, выйдет на свет, а то, что было на свету, уйдет в тень. Так и случилось. По ночам стали вылезать чудовища из лесов, из болот. Когда стало совсем плохо, люди вспомнили о свитке и решили найти его, дабы узнать ответ, когда вернется на землю мир. С этого момента начинается уже другая легенда о сумрачных временах!<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="ENTER"><b><font color=blue>Авторизация и выход</font></b></A><br>
<dd>Авторизация введена для того, чтобы за Вашего персонажа и за Ваше королевство могли играть только Вы. После регистрации Вы будете перенаправлены на страницу авторизации. Там Вам будет предложено ввести "Имя пользователя" (login) и "Пароль" (password). Их Вы указывали во время регистрации. Их необходимо помнить для того, чтобы успешно заходить в игру. Если по какой-либо причине Вы потеряли пароль или просто забыли его, то Вы можете написать разработчику и попросить предоставить его Вам, но необходимо будет указать какие-либо сведения, из регистрационной формы. По окончании Вашего хода обязательно выходите из системы. Тогда компьютеру проще будет сориентироваться например с тем, играть ли за Вашу армию во время осады Вашего замка и прочее. К тому же, во время того, как Вас нет в игре, компьютер автоматически начисляет Вам очки, которые впоследствии, при входе в игру пересчитываются в ресурсы, очки действия, здоровье и прочее...<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="RULES"><b><font color=blue>Правила общения</font></b></A><br>
<dd>Я специально решил ввести эту часть в "Документацию по Native Land" по той простой причине, что многие игроки любят использовать нецензурную лексику в своих выражениях, а также, оскорблять своих оппонентов. Помните, они такие же игроки и люди, как Вы! В систему я специально встроил фильтр нецензурных выражений, но если по какой-либо причине он не справляется и Вам-таки удалось использовать вышеупомянутые выражения, то наказание будет суровым. Например, блокировку на несколько дней. При повторной присечённой попытке, возможна полная дисквалификация игрока с пожизненной блокировкой. В общем, дело Ваше.<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="CREATE"><b><font color=blue>Создание персонажа</font></b></A><br>
<dd>Теперь несколько слов о создании Вашего персонажа. На Ваш выбор предлагается на выбор 6 рас, за которые Вы можете играть, и, соответственно, Ваш персонаж тоже будет принадлежать к этой расе. Ниже приведена таблица, в которую занесены все расы, и, соответственно, что даёт Вам выбор одной из них.<br><br>
	<center><table border=1 CELLSPACING=0 CELLPADDING=0>
	<tr><td align=center>Раса:</td><td>Сила:</td><td>Защита:</td><td>Ловкость:</td><td>Знания:</td><td>Удача:</td><td>Интеллект:</td></tr>
	<tr><td align=center>Человек</td><td align=center>+1</td><td align=center>+1</td><td align=center>+1</td><td align=center>0</td><td align=center>+1</td><td align=center>+1</td></tr>
    <tr><td align=center>Эльф</td><td align=center>+1</td><td align=center>0</td><td align=center>+2</td><td align=center>0</td><td align=center>+1</td><td align=center>+1</td></tr>
    <tr><td align=center>Гном</td><td align=center>+1</td><td align=center>+2</td><td align=center>+1</td><td align=center>0</td><td align=center>0</td><td align=center>+1</td></tr>
    <tr><td align=center>Друид</td><td align=center>0</td><td align=center>+1</td><td align=center>0</td><td align=center>+3</td><td align=center>0</td><td align=center>+1</td></tr>
    <tr><td align=center>Некромант</td><td align=center>+2</td><td align=center>0</td><td align=center>0</td><td align=center>+2</td><td align=center>-1</td><td align=center>+2</td></tr>
    <tr><td align=center>Еретик</td><td align=center>+1</td><td align=center>+2</td><td align=center>0</td><td align=center>+2</td><td align=center>-1</td><td align=center>+1</td></tr>
	</table></center><br>
После этого, Вы должны будете выбрать тип Вашего персонажа. Этот немаловажный параметр тоже добавляет Вам некоторые характеристики, как базовые, так и дополнительные (об этом ниже). В игре Вы можете прокачивать (играть за) персонажей разных типов. Это может быть как рыцарь, так стрелок и маг. У каждого из них свои достоинства и недостатки. Например маг может колдовать сильные заклинания на своего оппонента, но в свою очередь изначально он очень слаб физически. Но Вы можете это изменить в процессе игры (об этом тоже далее). Таблица типов персонажей приведена ниже.<br><br>

	<center><table border=1 CELLSPACING=0 CELLPADDING=0>
	<tr><td align=center>Тип:</td><td>Сила:</td><td>Защита</td><td>Ловкость:</td><td>Боевая магия:</td><td>Магия природы:</td><td>Магия разума:</td></tr>
	<tr><td align=center>Рыцарь</td><td align=center>+2</td><td align=center>+2</td><td align=center>+1</td><td align=center>0</td><td align=center>0</td><td align=center>0</td></tr>
    <tr><td align=center>Стрелок</td><td align=center>+2</td><td align=center>+1</td><td align=center>+2</td><td align=center>0</td><td align=center>0</td><td align=center>0</td></tr>
    <tr><td align=center>Маг</td><td align=center>0</td><td align=center>0</td><td align=center>0</td><td align=center>+2</td><td align=center>+2</td><td align=center>+1</td></tr>
    <tr><td align=center>Целитель</td><td align=center>0</td><td align=center>0</td><td align=center>0</td><td align=center>+1</td><td align=center>+3</td><td align=center>+1</td></tr>
    <tr><td align=center>Варвар</td><td align=center>+3</td><td align=center>+2</td><td align=center>0</td><td align=center>0</td><td align=center>0</td><td align=center>0</td></tr>
    <tr><td align=center>Волшебник</td><td align=center>0</td><td align=center>0</td><td align=center>0</td><td align=center>+1</td><td align=center>+1</td><td align=center>+3</td></tr>
	</table></center><br>

<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="MAIN"><b><font color=blue>Основные характеристики</font></b></A><br>
<dd>К основным характеристикам относятся 9 основных параметров Вашего персонажа. Это такие параметры, как: Сила, Защита, Ловкость, Знания, Удача, Интеллект. Каждый из этих параметров играет немаловажную роль для Вашего персонажа. Например, если Вы прокачаете силу, то Ваш герой в битвах будет наносить гораздо больше урона в ближнем бою. Т.е. в бою мечами, дубинами и так далее... Ловкость больше необходима лучникам. Чтобы они были более точны в своих выстрелах и наносили больше урона сопернику. К тому же, иногда Ваш герой может так изловчиться, что соперник промахнётся, тем самым не задев Вас. Защита необходима всем типам персонажей, не зависимо от их типа. Если это умение у Вас достаточно хорошо развито, то Вы сможете без труда отражать удары даже самых сильных оппонентов. Знания нужны конечно же магам. В первую очередь, знания позволяют Вам изучать большее количество заклинаний. Ну и конечно же интеллект. Он тоже необходим магам. Если Ваш интеллект, а точнее, интеллект Вашего героя очень сильно развит, то Ваши заклинания будут гораздо мощнее, чем у других. Хороший маг без труда выиграет битву у воина. Но не всё так просто, как кажется. Всех магов можно разделить на три типа. Просто маги, которые используют боевые заклинания (навык "боевая магия"), лекари, которые могут лечить себя и других (навык "магия природы"), ну и наконец - волшебники. Они используют навык "магия разума". Это специфический навык. Он позволяет использовать заклинания контроля. Т.е. Вы можете заставить Вашего оппонента атаковать самого себя, что, порой, гораздо эффективнее Ваших атак. Или ввести его в гипноз, в котором он будет находиться несколько ходов, а за это время спокойно разделаться с ним.<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="ADD"><b><font color=blue>Дополнительные характеристики</font></b></A><br>
<dd>Дополнительных характеристик существует огромное множество. Я не буду подробно описывать каждый из них. Они приведены в таблице ниже.<br><br>
<?
  include "functions.php";
  echo("<center><table border=1 CELLSPACING=0 CELLPADDING=0>");
  echo("<tr><td align=center>Способность</td><td align=center>Новичок</td><td align=center>Продвинутый</td><td align=center>Эксперт</td></tr>");

	$ath = mysql_query("select * from additional;");
	if ($ath)
	{
		while ($rw = mysql_fetch_row($ath))
      echo("<tr><td>".$rw[1]."</td><td>".$rw[7]."</td><td>".$rw[8]."</td><td>".$rw[9]."</td></tr>");
	}
  echo("</table></center>");
?>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="EXPA"><b><font color=blue>Опыт героя и уровни</font></b></A><br>
<dd>За каждую битву (смотрите ниже), герой получает определённый опыт (experience). Через некоторое время, когда её накопиться достаточно большое количество, уровень Вашего героя повысится. Чем Выше уровень Вашего героя, тем он сильнее. С повышением уровня, Вы можете увеличить несколько основных характеристик Вашего персонажа. Обращаю Ваше внимание, что самое большое количество дополнительных характеристик - 15. Также, обращаю Ваше внимание, что максимум для уровня героя не определён. Вы можете прокачивать Вашего героя до "бесконечности" (пока компьютер не загнётся от вычислений, а поверьте мне - это очень долго :) ). Ниже Вы можете видеть таблицу опыта, необходимого для перехода на следующий уровень.<br>

<center>
<script language=JavaScript>
function wnd()
{
	s = "expa.php?limit=" + document.lim.limit.value;
	window.open(s, null,'toolbar=no, location=no, menubar=no,scrollbars=yes,width=320,height=240');
}
</script>
<form name="lim">
<b>Введите верхний уровень:</b><br>
<input type=text name=limit value=50 maxlength=4><br>
</form>
<a href='javascript:wnd();'><font color=blue><b>Показать</b></font></a>
</center>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="INV"><b><font color=blue>Инвентарь</font></b></A><br>
<dd>Нажав на кнопку "инвентарь", Вы можете видеть вещи, которые одеты на Вашем персонаже. Также, чуть ниже Вы можете видеть инвентарь Вашего персонажа. Здесь отображаются все собранные и купленные Вами артефакты, а также разные ёмкости с зельями для повышения магической силы и здоровья.<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="WEAPONS"><b><font color=blue>Оружие и артефакты</font></b></A><br>
<dd>Оружие и артефакты - в сущности, одно и то же. Вы можете одеть на себя какую-нибудь кольчугу, которую купили в кузнице и она будет прибавлять Вам несколько процентов брони. Тоже самое с оружием, шлемами, плащами и прочим. Вообще, все артефакты по типу распределения в игре делятся на следующие типы: шлемы, амулеты, броня, плащи, щиты, оружие, кольца, щитки, сапоги. В свою очередь, оружие делится тоже на несколько типов: режущее (мечи, сабли, ятаганы), рубящее (топоры, секиры), дробящее (молоты, булавы), стрелковое (луки, арбалеты). К тому же, помимо всего вышеперечисленного в игре есть ещё один тип предметов - это разные предметы. Например, ёмкости с зельями здоровья и магической силы.<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="BATTLES"><b><font color=blue>Битвы с монстрами</font></b></A><br>
<dd>Нажав на кнопку "Выйти из города", Вы оказываетесь за его пределами. На Вас могут напасть случайные монстры Вашего уровня. А точнее не могут, а нападут. Всего в игре существует 76 различных монстров включая тех, которых Вы можете нанимать в Вашу армию. Так вот. Во время каждой битвы Вы можете просто атаковать монстра (тем, то у Вас есть в руках или просто руками), 1 раз за битву можете использовать суператаку (у каждой расы своя) и, естественно, Вы просто можете колдовать (о магии ниже). За битву с каждым монстром Вы будете получать определённый опыт. Чем круче Ваш персонаж, тем круче становятся встречающиеся ему монстры.<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="VSPEOPLE"><b><font color=blue>Битвы с людьми</font></b></A><br>
<dd>Самой интересной частью игры являются битвы между людьми. Здесь Вы соревнуетесь на с компьютерным оппонентом, а с реальным человеком, у которого тоже есть свой сильный персонаж. Все возможности битвы те же. Суператака 1 раз за ход, обычная атака и магия. Кстати, в обоих битвах есть кнопка "Сдаться". Нажав на неё, Вы можете избежать смерти, но Вам придётся попрощаться со всеми вещами, которыми обладает Ваш персонаж, к тому же, опыт Вашего персонажа заметно понизится. За выигранную битву, Вы получите много опыта. Это зависит от уровня Вашего оппонента. Вы можете нападать только на персонажей с таким же уровнем как и у Вас или выше. Если по какой-либо причине Вас победили (сами Вы не сдавались), то за битву Вы не получите опыта. Просто Ваше здоровье будет равным нулю. Необходимо будет подождать пока оно регенерируется.<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="RESPAWN"><b><font color=blue>Лечение и восстановление</font></b></A><br>
<dd>Если Вас победили или просто Ваше здоровье заметно снизилось, то Вы не обязаны просто ждать пока оно регенерируется. Вам просто необходимо зайти в "Храм" (предварительно построив его [об этом ниже]), и вылечиться там.<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="MAGIC"><b><font color=blue>Магия</font></b></A><br>
<dd>Во время битвы Ваш персонаж может использовать различные заклинания. Все заклинания в игре делятся на три категории. Они относятся либо к магии природы, либо к атакующей магии, либо к магии разума. Магия природы может как атаковать, так и лечить. Магия разума - контролировать Вашего оппонента, а атакующая магия говорит сама за себя. Ниже Вы можете видеть таблицу заклинаний.<br><br>
<center>
<table border=1 width=90% CELLSPACING=0 CELLPADDING=0>
<tr><td colspan=6 align=center>Магия</td></tr>
<tr><td colspan=2 align=center>Магия природы</td><td colspan=2 align=center>Атакующая магия</td><td colspan=2 align=center>Магия разума</td></tr>
<tr><td align=center>Заклинание</td><td align=center>Эффект</td><td align=center>Заклинание</td><td align=center>Эффект</td><td align=center>Заклинание</td><td align=center>Эффект</td></tr>

<tr><td align=center>Молния</td><td align=center>Наносит базовый урон 10%</td><td align=center>Метеорит</td><td align=center>Наносит базовый урон 12%</td><td align=center>Гипноз</td><td align=center>Ваш оппонент пропускает следующий ход</td></tr>
<tr><td align=center>Смерч</td><td align=center>Наносит базовый урон 15%</td><td align=center>Серный дождь</td><td align=center>Наносит базовый урон 14%</td><td align=center>Забывчивость</td><td align=center>Ваш оппонент пропускает следующие два хода</td></tr>
<tr><td align=center>Лечение</td><td align=center>Восстанавливает 20% Вашего здоровья</td><td align=center>Вспышка</td><td align=center>Наносит базовый урон 20%</td><td align=center>Проклятье</td><td align=center>Снижает атаку и защиту оппонента на 25%</td></tr>
<tr><td align=center>Ледяная стрела</td><td align=center>Наносит базовый урон 20%</td><td align=center>Поджечь</td><td align=center>Наносит базовый урон 50%</td><td align=center>Лечение</td><td align=center>Ваш противник лечит Вас вместо себя</td></tr>
<tr><td align=center>Высосать жизнь</td><td align=center>25% здоровья Вашего оппонента переходят к Вам</td><td align=center>Волна смерти</td><td align=center>Наносит базовый урон: 30% Вам и 60% оппоненту</td><td align=center>Самоубийца</td><td align=center>Наносит базовый урон 70%</td></tr>
<tr><td align=center> </td><td align=center> </td><td align=center>Метеоритный дождь</td><td align=center>Наносит базовый урон 70%</td><td align=center> </td><td align=center> </td></tr>
</table>
</center><br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="RESOURCES"><b><font color=blue>Ресурсы</font></b></A><br>
<dd>В игре существует три основных ресурса. Это металл, камень и дерево. Каждое королевство может добывать только один из них. Либо металл, либо камень, либо дерево. Два остальных Вы можете импортировать у Ваших союзников или других игроков. Затраты всех ресурсов приблизительно уравновешены, но так как при строительстве уходит в 2 раза больше камня и дерева, то и добывают его те страны, в которых он добывается в два раза быстрее. Основным обменным ресурсом считается металл, но это совсем не значит, что страна, которая его добывает более богата ил развита. Просто для более удобного пересчёта из одной валюты в другую, осуществляется пересчёт через металл. Металл - твёрдая Валюта игры.<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="MONEY"><b><font color=blue>Деньги и  их курс. Основной ресурс.</font></b></A><br>
<dd>При регистрации, Вы указывали курс Ваших денег к металлу, так вот: металл - основной ресурс игры, твёрдая валюта, через которую проводятся все денежные вычисления. В том числе, курс одной валюты к другой пересчитывается через металл. За деньги Вы можете нанимать армию, деньги нужны Вам также и для строительства. Также, за деньги Вы можете лечить Вашего персонажа или покупать ему различные предметы в кузницах.<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="BANK"><b><font color=blue>Банк</font></b></A><br>
<dd>Через банк Вы можете передавать деньги Вашим союзникам или другим игрокам. При этом, банкиры автоматически переводят Вашу валюту в валюту королевства-адресата и производят сам перевод. За перевод берётся 5% отправляемых денег. В дальнейшем я планирую включить в систему банков кредитную систему и, соответственно, систему накопления денег на счетах клиентов.<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="TRADE"><b><font color=blue>Торговля</font></b></A><br>
<dd>Построив рынок, Вы сможете посылать не только деньги другим игрокам, но и все ресурсы. Металл, дерево, камень.<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="BUILD"><b><font color=blue>Строительство</font></b></A><br>
<dd>Выше я часто употреблял слово "построить". Вы можете строить различные здания в Вашей столице. Я не буду приводить здесь таблицу всех доступных для строительства зданий и объектов, потому, что она займёт много места. Просто постараюсь кратко описать: в Вашем меню, слева, есть пункт "Строительство". Нажав на него, Вы можете выбрать здание, которое хотите построить. Все здания нужны для какой-либо определённой цели. Например, первые три - приносят в Вашу казну дополнительный доход. Шахты увеличивают прирост основного ресурса Вашей страны. Построив рынок, Вы сможете отправлять и принимать ресурсы. (Настоятельно рекомендую строить его в первую очередь). В "Гильдии магов" Вы сможете покупать для своего персонажа различные заклинания. В кузнице - предметы...<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="ARMY"><b><font color=blue>Армия и её применение</font></b></A><br>
<dd>Построив самое последнее здание из предлагаемого списка, Вы сможете нанимать армию для своего королевства. Применять её можно в двух областях. Думаю, что Вы уже догадались: защита и завоевание. Допустим Вы не хотите с кем-либо торговать. Набрали армию, послали атаковать противника, завоевали его город, разграбили его и всё. Или наоборот, Вы честный и миролюбивый человек. Или Вас больше интересуют элементы РПГ. Тогда Вам просто необходима армия для защиты Вашего королевства. При попытках набегов на Вас она будет доблестно защищать Ваше королевство и его население.<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="UNIONS"><b><font color=blue>Военные союзы</font></b></A><br>
<dd>Если Вы не хотите даже держать армию, то есть ещё один выход - военные союзы. Чтобы противнику не достались Ваши ресурсы, просто отдайте их союзникам. В замен на то, что они будут защищать Вас. То есть, если на Вас нападёт какой-нибудь завоеватель, то Ваши союзники, в свою очередь тоже объявляют ему войну и нападают на него. К тому же, союзы необходимы для более выгодной торговли. Пошлины при торговле становятся ниже. Ещё одним достоинством союзов является общая армия. Если, например, у меня в разделе союзы установлен игрок n, и у него в союзах установлен я, то: если, например, на меня нападает игрок k, то армия игрока n идёт мне на помощь в удержании замка. Общая армия работает только в случае обороны территории. Не захвата.<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="CLANS"><b><font color=blue>Кланы</font></b></A><br>
<dd>Для того чтобы создать клан, Ваш герой должен дойти до "Великой ассоциации по наблюдению за кланами" (ВАНК), которая находится на юго-западе материка и поговорить с мастером кланов (NPC). Заплатив ему кругленькую сумму, Вы получите патент на создание клана, в котором будет значиться, что Вы его предводитель. Там же будет выдан суперудар. Затем, Вам надо будет написать историю клана, найти для него логотип, написать правила и законы клана и отнести их в "ВАНК". Этоможно сделать сразу, при получении патента. Затем, необходимо будет ежедневно уплачивать со счёта клана отчисления в ВАНК. Размер отчислений зависит от количество персонажей в Вашем клане. В BAHK должен идти только будущий ГЛАВА клана. Теперь о достоинствах клана. У каждого клана есть своя (или свои (их может быть несколько)) дополнительных способностей. Каждую из них может использовать любой игрок, входящий в данный клан. Кланы обычно создаются людьми с единым мышлением (игровым имеется в виду).<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="SPY"><b><font color=blue>Разведка и шпионаж</font></b></A><br>
<dd>Если же Вы решили обладать собственной армией, то Вам просто необходимо разведывательное управление. Перед тем как на кого-то напасть, Вам необходимо разведать некоторую информацию об этом королевстве. Например, какой ресурс там добывается, то есть, есть ли смысл в начале ведения войны. Или ещё более важную информацию - примерное количество армии врага.<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="MUSTDO"><b><font color=blue>Законы и правила игры</font></b></A><br>
<dd><font color=green>Все законы игры обязательны для исполнения независимо от статуса, уровня и прочих параметров персонажа и игрока.</font><br>
<font color=white>Параграф 1. Законы игры</font><br>
<dd>1) <Закон> Запрещается какими-либо средствами мешать нормальной работе сервер, всячески взламывать переделывать и нарушать его работу.<br>
<dd>2) <Закон> Запрещается использовать в личных целях какие-либо элементы или весь программный продукт Native Land без персонального письменного соглашения её авторов, а именно: Елисеева Дмитрия Сергеевича и Титберия Олега Олеговича<br>
<dd>3) <Закон> Запрещается любыми способами мешать нормальной игре других игроков, а также, проводить пропаганду и наносить моральный вред другим игрокам.<br>
<dd>4) <Закон> Запрещается использовать нецензурную лексику при общении с другими игроками внутри игры, наносить личные или групповые оскорбления в любой форме другим игрокам.<br>
<dd>5) <Закон> Запрещается использовать различные скрипты, программы и прочие средства для взлома игры по отношению к Native Land<br>
<dd>6) <Закон> Все законы всех разделов обязательны для исполнения. Правил желательно придерживаться. Количество и содержание законов может меняться администрацией Native Land<br>
<dd>7) <Закон> Пренебрежение и нарушение вышеперечисленных законов влечёт за собой административное наказание. Высшая форма наказания - удаление аккаунта и пожизненный БАН на текущем игровом сервере Native Land. Все иные наказания выносятся после группового обсуждения администрацией игры.<br>
<font color=white>Параграф 2. Законы пользования игровым чатом IRC, а также форумом игры</font><br>
<dd>1) <Закон> Запрещается использовать ненормативную лексику<br>
<dd>2) <Закон> Запрещается в общем канале наносить моральный вред другим игрокам, а именно, оскорблять их и наносить прочий моральный урон<br>
<dd>3) <Закон> Запрещается ФЛУДить. (Писать много ненужного текста, засорять канал и форум всякой чепухой)<br>
<dd>4) <Закон> За нарушение данных законов, в результате решения комиссии, состоящей из администрации, нарушителю может быть выставлен бан на канал Native Land. Длительность определяется решением комиссии<br>
<font color=white>Параграф 3. Другие законы игры</font><br>
<dd>1) <Закон> На одного человека может быть зарегистрирован только один аккаунт<br>
<dd>2) <Закон> На одного человека может быть зарегистрирован только один клан<br>
<dd>3) <Закон> Один человек может занимать только одну административную должность<br>
<dd>4) <Закон> Один человек может состоять только в одном клане<br>
<dd>5) <Закон> Все предложения по усовершенствованию игры администратор рассматривает только после того, как их подробное описание пришло ему по электронной почте или было оставлено на форуме в разделе "Предложения"<br>
<dd>4) <Закон> Зарегистрированные персонажи с не правильными e-mail адресами, а также, с неверной информацией о себе (фамилия и имя) будут незамедлительно удаляться<br>
<dd>6) <Закон> <br>
<dd>7) <Закон> <br>
<dd>8) <Закон> <br>
<dd>9) <Закон> <br>
<dd>10) <Закон> <br>
<dd><dd>P.S. Здесь под "человеком" понимается не раса игрового персонажа, а игрок, т.е. Вы.<br>

<font color=white>Параграф 4. Правила, которых желательно придерживаться в рамках игры Native Land</font><br>
<dd>1) <Правило> На карте не нападать на героев с меньшим уровнем<br>
<dd>2) <Правило> Желательно при регистрации в игре, также регистрироваться на форуме. Это не является обязательной обязанностью, но это можно рассматривать, как ВАЖНУЮ рекомендацию<br>
<dd>3) <Правило> (Рекомендация) Реклама игры приветсвуется и поощряется<br>
<font color=white>Параграф 5. Некоторые права игроков</font><br>
<dd>1) <Право> Игрок имеет право затребовать восстановление своего персонажа, в случае его утери, если:<br>
<dd><dd>а) Персонаж не попал под ежемесячную очистку базы данных. (Она проводится 01.x.xxxx числа каждого месяца). Удаляются все персонажы, опыт непревышает 10.<br>
<dd><dd>б) Персонаж не был намеренно удалён администрацией портала за нарушение игроком законов игры.<br>
<dd><dd>в) <br>
<center><b><font color=lightgreen>P.S. Эти законы, правила, рекомендации, права и обязанности могут дополняться и изменятся администрацией портала. Несоблюдение и(или) незнание этих законов не освобождает Вас от ответсвенности.</font></b></center><br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="FAQ"><b><font color=blue>Часто задаваемые вопросы и ответы.</font></b></A><br>
Q: (Sergoper) Какой ресурс важнее?<br>
A: (Admin) В принципе, все ресурсы важны одинаково. Нет таких, которые нужны в<br>
большей или меньшей степени. Просто в игре сложилась такая ситуация (по моей<br>
глупости), что у большинства игроков оказался металл. Из-за этого, он так сказать<br>
обесценился. Но это ничего не меняет. Все ресурсы важны одинаково.<br><br>

Q: (TbMA) Что лучше прокачивать воину?<br>
A: (Admin) Я бы советовал прокачивать силу и ловкость.<br><br>

Q: (Anarki) Зачем нужна ловкость?<br>
A: (Admin) Ловкость увеличивает количество очков действия, которые нужны персонажу<br>
во время битвы. Эти самые ОД он может расходовать на различные удары или их<br>
комбинации. А также, для того, чтобы использовать магию.<br><br>

Q: (Sergoper) Что даёт раса, зачем она нужна, какой легче играть?<br>
A: (Admin) Вообще говоря, раса как бы условно делит всех персонажей по типажу.<br>
Главное преимущество от её выбора наблюдается в начале игры. В зависимоти от<br>
расы у персонажа распределяются некоторые характеристика по разному. К тому же,<br>
раса определяет суперудар Вашего героя. Он небходим во время битвы с монстрами.<br><br>

Q: (Anarki) Зачем строить новые шахты и города?<br>
A: (Admin) Во-первых, скоро будет переработана стратегическая часть игры, т.е.<br>
найм армии например будет происходить из мирного населения, максимум которого<br>
определяется количеством городов. Крестьяне будут платить налоги, а армия требовать<br>
на себя деньги. Шахты, лесопилки и карьеры будут приносить ресурсы, необходимые <br>
для строительства других городов или зданий. Простые города будут в свою очередь<br>
тоже потреблять некоторое количество ресурсов.<br><br>

Q: (Eugene) Что за очки действия не в битве?<br>
A: (Admin) Это очки действия, которые Вы можете расходовать на строительство зданий<br>
в городе, на битвы с монстрами и на перемещения по королевству.<br><br>

Q: (Teider) А есть ли разница на лошади герой или нет?<br>
A: (Admin) Конечно есть. Если Ваш герой на лошади, то его перемещения могут быть<br>
гораздо дальше, а ОД на него он потратит гораздо меньше.<br><br>

Q: (Sergoper) Допустим, я только что начал игру. На карте на меня может напасть<br>
любой и победить. Разве это интересно?<br>
A: (Admin) Я полагаю, что все игроки к этому относятся по разному. Лично я считаю,<br>
что раз Ваш герой не в городе, то на него может напасть любой. Сильный или слабый<br>
не важно. Но. Раз уж мы делаем приближение к реальной ситуации, то я позаботился <br>
вот о чём: прежде отойти от монитора и уйти по делам, Вы можете, потратив n-e <br>
количество ОД, соорудить укрытие на карте, или спрятаться в зарослях. Или забрести<br>
в какой-нибудь город и переночевать в гостинице. Тогда на Вас не смогут напасть<br>
просто так. Именно такой принцип был использован в известной BBS игре "DeathMasters"<br><br>

Q: (Sergoper) Зачем нужно заключать союзы?<br>
A: (Admin) Во-первых, заключив союз, пошлины на торговлю внутри него снижаются на 15%<br>
Во-вторых, у союзников "общая армия". Т.е. если Вы заключили союз, а на Вас напали, то<br>
армия Ваших союзников всегда поможет Вам. Если в графе союзы Вы ставите какого-нибудь<br>
игрока в союзники, то это значит, что Ваша армия будет ему помогать только при нападении<br>
на него. Если Ваш союзник вздумает нападать, то Ваша армия будет отдыхать. Но, за<br>
содержание союза необходимо производить некоторые отчисления в ВЗОС (Великая западная<br>
организация союзов).<br><br>

Q: (Sergoper) А разделение на свет и тьму будет?<br>
A: (Admin) Разделение это пока условно. Но в дальнейшем планируется провести разделение<br>
игроков на эти стороны. Стороны будут развиваться по разному и для каждая из сторон<br>
сможет выполнять только те квесты, которые предназначены для неё. Нейтральные же<br>
персонажи смогут выполнять квесты как за свет, так и за тьму. Но они не могут выполнять<br>
специальные квесты. Т.е. специальные квесто предназначенные только для света или только<br>
для тьмы. Из этого следует, что количество игроков, отдавших предпочтение свету или <br>
тьме на игровой процесс не повлияет. Зависеть он будет от умственных способностей<br>
игроков.<br>

Q: (Sergoper) А что с кланами? Они будут?<br>
A: (Admin) Да. В глобальный план по созданию игры они включены. Создав какой-нибудь<br>
клан, Вы являетесь его предводителем. У каждого клана будет своё собственное место<br>
сбора на карте. Вступив в клан, Вы получите какую-нибудь новую способность. Пока это<br>
всё только на бумаге, но скоро будет притворено в жизнь.<br><br>

Q: (Faust) Нужны ресурсы, а рынка нет?<br>
A: (Admin) Есть два варианта. 1) Попросить у кого-нибудь из игроков на честном слове<br>
что потом отдадите. 2) Драться с монстрами. За них дают ресурсы.<br><br>

Q: (Scrapy) Что за северный союз такой?<br>
A: (Admin) Пока у Вас нет казармы, на Вас не могут напасть другие игроки. Т.е. вы входите<br>
в "антивоенный" военный союз. Вы платите ему дань за охрану Вашего королевства. Как только<br>
Вы построете казарму, Вы перестаните платить дань ему, но на Вас смогут нападать другие.<br><br>

Q: (Cancer) Почему при покупке оружия мой маг стал рыцарем?<br>
A: (Admin) Деление на классы условно. Оно необходимо только в начале игры для распределения<br>
базовых характеристик. Потом он зависит от оружия в руке.<br><br>

Q: (Maloy) Когда появятся кланы?<br>
A: (Admin) Однозначно ответить на этот вопрос трудно. Пока они только в проекте. Я полагаю,<br>
что как только разберусь с картой, так сразу займусь кланами.<br><br>

Q: (KPAH) А что это за кнопка "Королевство"?<br>
A: (Admin) Нажав на неё, вы сможете выходить героем из Вашего замка и перемещаться по <br>
огромной карте материка, на котором собственно и происходят все события. Там Вы сможете<br>
получать квесты, строить шахты, лесопилки и основывать другие города. Но также на Вас могут<br>
напасть монстры или другие игроки.<br><br>

Q: (KPAH) А зачем строить шахты, если и так весь замок отсроен?<br>
A: (Admin) Причин на это довольно много. Вот некоторые из них: 1) Время от времени на <br>
материке (Неония называется) происходят стихийные бедствия, которые, разрушают Ваши замки<br>
частично или полностью. 2) Другие игроки, построив Гильдию магов II уровня могут насылать<br>
на Ваше королевство те же бедствия. 3) Шахты приносят ресурсы, которые пригодятся для <br>
строительства мирных городов. Эти города приносят в казну деньги и увеличивают максимальное<br>
количество крестьян, а следовательно и максимальный размер Вашей армии.<br><br>

Q: (KPAH) Бесконечна ли магия в бою?<br>
A: (Admin) Да, бесконечна. Для её использования нужны только очки действия.<br><br>

Q: (PASA) Что нужно, чтобы создать клан?<br>
A: (Admin) Ваш герой должен дойти до "Великой ассоциации по наблюдению за кланами" (ВАНК),<br>
которая находится на юго-западе материка и поговорить с мастером кланов (NPC). Заплатив ему <br>
кругленькую сумму, Вы получите патент на создание клана, в котором будет значиться, что Вы<br>
его предводитель. Там же будет выдан суперудар. Затем, Вам надо будет написать историю <br>
клана, найти для него логотип, написать правила и законы клана и отнести их в "ВАНК". Это<br>
можно сделать сразу, при получении патента. Затем, необходимо будет ежедневно уплачивать<br>
со счёта клана отчисления в ВАНК. Размер отчислений зависит от количество персонажей в Вашем<br>
клане. Сейчас также появился альтернативный вариант регистрации. В каждом городе появился филиал ВАНК. Вы можете зарегистрировать новый клан не выходя из города<br>
P.S. В BAHK должен идти только будущий ГЛАВА клана.<br><br>

Q: ()<br>
A: ()<br><br>

Q: (Anonymous) Чем я могу помочь игре?<br>
A: (Admin) Вы можете помочь нам с оплатой хостинга. Внесите свой вклад в его оплату<br><br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>

<A NAME="OUTRO"><b><font color=blue>Заключение</font></b></A><br>
<dd>В заключении хотелось бы пожелать всем приятной игры, а также попросить о том, чтобы Вы сообщали о всех недоработках и ошибках, возникающих во время игры мне. Адрес: <a href="mailto:dima_eliseev@users.mns.ru">dima_eliseev@users.mns.ru</a><br>
<dd>И наконец, за размещённые на сайте материалы (оставленные иными лицами), администрация сайта ответственности не несёт. А также, любое копирование, распостранение и использование в коммерческих и иных целях материалов с данного сайта запрещается без согласия разработчиков портала.<br>
<a href="#begin"><font color=yellow>В начало</font></a><br><br>
<center>Copyright © 2004</center><br>

<center>Автор текста: <font color=white>Елисеев Дмитрий</font></center>